# Temperature Rating Class

Source: https://www.revitapidocs.com/2026/e631810b-d26b-b58e-3e0e-4a413b175305.htm

---

| Temperature Rating Class |
| --- |

This class represents the definition of Conductor Temperature Rating data. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Electrical TemperatureRating

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class TemperatureRating : IDisposable
```

```
Public Class TemperatureRating
	Implements IDisposable
```

```
public ref class TemperatureRating : IDisposable
```

```
type TemperatureRating =
    class
        interface IDisposable
    end
```
The TemperatureRating type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Temperature Rating id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Temperature Rating name. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Temperature Rating. |
|  | Dispose | Releases all resources used by the TemperatureRating |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetTemperatureRating | Gets the Conductor Temperature Rating data by given Conductor Temperature Rating id. |
|  | GetTemperatureRatingIdByName | Gets the Conductor Temperature Rating id by given Conductor Temperature Rating name. |
|  | GetTemperatureRatingIds | Gets all the Conductor Temperature Rating ids in the given document, sorted by name. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace